SpenceKonde/DxCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#  #######              #####                                            #
#  ##    ##            ##```                                             #
#  ##     ## ##   ##   ##      ###  ####  ####     ##     #  #     ###   #
#  ##     ##  ## ##    ##     #   # #   # #       ###     #  #    #  ##  #
#  ##     ##   ###     ##     #   # ####  ###      ##     ####    # # #  #
#  ##    ##   ## ##    ##___  #   # # #   #        ##  ##    # ## ##  #  #
#  #######   ##   ##    #####  ###  #  #  ####    #### ##    # ##  ###   #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other contributors 2020-2021               #
#  Based on megaTinyCore which in turn is based on official Arduino core #
#  Varying portions of different files in this core can be traced back   #
#  to the official core. In any event, it's all free software, under the #
#  (LGPL v2.1) see LICENSE.md and License section of README.md           #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition.                              #
#________________________________________________________________________#
#                                                                        #
#                   ####   ###   ###  ####  ####   ###                   #
#                   #   # #   # #   # #   # #   # #                      #
#                   ####  #   # ##### ####  #   #  ###                   #
#                   #   # #   # #   # #  #  #   #     #                  #
#                   ####   ###  #   # #   # ####   ###                   #
#________________________________________________________________________#
#                                                                        #
# Names listed at the top so they can be kept in consistent format.      #
# Experience has shown that they end up drifting apart is style if       #
# they aren't all on the same screen                                     #
#                                                                        #
# EA, DD are not available yet                                           #
#                                                                        #
# All DD board defs sketched in and commented out, very few unknowns     #
#                                                                        #
# Only EA boards without optiboot sketched in - since we know like       #
# nothing about implementation, and how Dx-y it will be.                 #
#________________________________________________________________________#

avrda.name=AVR DA-series (no bootloader)
avrdb.name=AVR DB-series (no bootloader)
#avrdd.name=AVR DD-series (no bootloader)
#avrea.name=AVR EA-series (no bootloader)
#microchip.name=Microchip Curiosity Nano
avrdaopti.name=AVR DA-series (Optiboot)
avrdbopti.name=AVR DB-series (Optiboot)
#avrddopti.name=AVR DD-series (Optiboot)
#avreaopti.name=AVR EA-series (Optiboot)
azduinoboard.name=Azduino Boards (Optiboot)



##########################################################################
#                                                                        #
#             ###  #   # ####  #   # #### #   # #   #  ###               #
#            #     #   # #   # ## ## #    ##  # #   # #                  #
#             ###  #   # ####  # # # ###  # # # #   #  ###               #
#                # #   # #   # #   # #    #  ## #   #     #              #
#             ###   ###  ####  #   # #### #   #  ###   ###               #
#________________________________________________________________________#

menu.chip=Chip
menu.board=Board/version
menu.clock=Clock Speed
menu.millis=millis()/micros() timer
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.eesave=Save EEPROM
menu.eesavedd=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function
menu.resetupdipins=Reset and UPDI pin functions (Bootload burn req'd)
menu.startuptime=Startup Time
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.timeout=Bootloader Timeout (Bootload burn req'd)
menu.appspm=Flash Writing
menu.mvio=MultiVoltage I/O (MVIO)
menu.attach=attachInterrupt() Version
menu.printf=printf()
menu.wiremode=Wire (Wire.h/I2C) Library mode



##########################################################################
#                                                                        #
###                 ###  #     # ####      ####   ###                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #####             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  #   #                 ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DA parts   #
#________________________________________#
avrda.upload.tool=avrdude
avrda.upload.with_programmer_not_available_for_bootloader_boards=
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.f_cpu={build.speed}000000L
avrda.build.text_section_start=.text=0x0
avrda.build.extra_flags= {bootloader.appspm}
avrda.build.export_merged_output=false
avrda.build.printf=

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase

