SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
#avrdd.bootloader.tool=avrdude
#avrdd.bootloader.WDTCFG=0x00
#avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
#avrdd.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdd.bootloader.CODESIZE=0x00
#avrdd.bootloader.BOOTSIZE=0x01
#avrdd.bootloader.avrdudestring=
#avrdd.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrdd.build.mcupostfix=
#avrdd.build.printfabr=
#avrdd.build.wireabr=
#avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
#avrdd.menu.chip.avr64dd14=AVR64DD14
#avrdd.menu.chip.avr64dd14.build.mcu=avr64dd14
#avrdd.menu.chip.avr64dd14.upload.maximum_size=65536
#avrdd.menu.chip.avr64dd14.upload.maximum_data_size=8192
#avrdd.menu.chip.avr64dd14.build.highestcb=B1
#avrdd.menu.chip.avr64dd14.build.variant=14pin-ddseries
#avrdd.menu.chip.avr64dd20=AVR64DD20
#avrdd.menu.chip.avr64dd20.build.mcu=avr64dd20
#avrdd.menu.chip.avr64dd20.upload.maximum_size=65536
#avrdd.menu.chip.avr64dd20.upload.maximum_data_size=8192
#avrdd.menu.chip.avr64dd20.build.highestcb=B1
#avrdd.menu.chip.avr64dd20.build.variant=20pin-ddseries
#avrdd.menu.chip.avr64dd28=AVR64DD28
#avrdd.menu.chip.avr64dd28.build.mcu=avr64dd28
#avrdd.menu.chip.avr64dd28.upload.maximum_size=65536
#avrdd.menu.chip.avr64dd28.upload.maximum_data_size=8192
#avrdd.menu.chip.avr64dd28.build.variant=28pin-ddseries
#avrdd.menu.chip.avr64dd32=AVR64DD32
#avrdd.menu.chip.avr64dd32.build.mcu=avr64dd32
#avrdd.menu.chip.avr64dd32.upload.maximum_size=65536
#avrdd.menu.chip.avr64dd32.upload.maximum_data_size=8192
#avrdd.menu.chip.avr64dd32.build.variant=32in-ddseries
##avrdd.menu.chip.avr32dd14=AVR32DD14
##avrdd.menu.chip.avr32dd14.build.mcu=avr32dd14
##avrdd.menu.chip.avr32dd14.upload.maximum_size=32768
##avrdd.menu.chip.avr32dd14.upload.maximum_data_size=4096
##avrdd.menu.chip.avr32dd14.build.highestcb=B1
##avrdd.menu.chip.avr32dd14.build.variant=14pin-ddseries
##avrdd.menu.chip.avr32dd20=AVR32DD20
##avrdd.menu.chip.avr32dd20.build.mcu=avr32dd20
##avrdd.menu.chip.avr32dd20.upload.maximum_size=32768
##avrdd.menu.chip.avr32dd20.upload.maximum_data_size=4096
##avrdd.menu.chip.avr32dd20.build.highestcb=B1
##avrdd.menu.chip.avr32dd20.build.variant=20pin-ddseries
##avrdd.menu.chip.avr32dd28=AVR32DD28
##avrdd.menu.chip.avr32dd28.build.mcu=avr32dd28
##avrdd.menu.chip.avr32dd28.upload.maximum_size=32768
##avrdd.menu.chip.avr32dd28.upload.maximum_data_size=4096
##avrdd.menu.chip.avr32dd28.build.variant=28pin-ddseries
##avrdd.menu.chip.avr32dd32=AVR32DD32
##avrdd.menu.chip.avr32dd32.build.mcu=avr32dd32
##avrdd.menu.chip.avr32dd32.upload.maximum_size=32768
##avrdd.menu.chip.avr32dd32.upload.maximum_data_size=4096
##avrdd.menu.chip.avr32dd32.build.variant=32in-ddseries
##avrdd.menu.chip.avr16dd14=AVR16DD14
##avrdd.menu.chip.avr16dd14.build.mcu=avr16dd14
##avrdd.menu.chip.avr16dd14.upload.maximum_size=16384
##avrdd.menu.chip.avr16dd14.upload.maximum_data_size=2048
##avrdd.menu.chip.avr16dd14.build.highestcb=B1
##avrdd.menu.chip.avr16dd14.build.variant=14pin-ddseries
##avrdd.menu.chip.avr16dd20=AVR16DD20
##avrdd.menu.chip.avr16dd20.build.mcu=avr16dd20
##avrdd.menu.chip.avr16dd20.upload.maximum_size=16384
##avrdd.menu.chip.avr16dd20.upload.maximum_data_size=2048
##avrdd.menu.chip.avr16dd20.build.highestcb=B1
##avrdd.menu.chip.avr16dd20.build.variant=20pin-ddseries
##avrdd.menu.chip.avr16dd28=AVR16DD28
##avrdd.menu.chip.avr16dd28.build.mcu=avr16dd28
##avrdd.menu.chip.avr16dd28.upload.maximum_size=16384
##avrdd.menu.chip.avr16dd28.upload.maximum_data_size=2048
##avrdd.menu.chip.avr16dd28.build.variant=28pin-ddseries
##avrdd.menu.chip.avr16dd32=AVR16DD32
##avrdd.menu.chip.avr16dd32.build.mcu=avr16dd32
##avrdd.menu.chip.avr16dd32.upload.maximum_size=16384
##avrdd.menu.chip.avr16dd32.upload.maximum_data_size=2048
##avrdd.menu.chip.avr16dd32.build.variant=32in-ddseries

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
#avrdd.menu.clock.24internal=24 MHz internal
#avrdd.menu.clock.24internal.build.speed=24
#avrdd.menu.clock.24internal.build.clocksource=0
#avrdd.menu.clock.20internal=20 MHz internal
#avrdd.menu.clock.20internal.build.speed=20
#avrdd.menu.clock.20internal.build.clocksource=0
#avrdd.menu.clock.16internal=16 MHz internal
#avrdd.menu.clock.16internal.build.speed=16
#avrdd.menu.clock.16internal.build.clocksource=0
#avrdd.menu.clock.12internal=12 MHz internal
#avrdd.menu.clock.12internal.build.speed=12
#avrdd.menu.clock.12internal.build.clocksource=0
#avrdd.menu.clock.10internal=10 MHz internal
#avrdd.menu.clock.10internal.build.speed=10
#avrdd.menu.clock.10internal.build.clocksource=0
#avrdd.menu.clock.8internal=8 MHz internal
#avrdd.menu.clock.8internal.build.speed=8
#avrdd.menu.clock.8internal.build.clocksource=0
#avrdd.menu.clock.4internal=4 MHz internal
#avrdd.menu.clock.4internal.build.speed=4
#avrdd.menu.clock.4internal.build.clocksource=0
#avrdd.menu.clock.1internal=1 MHz internal
#avrdd.menu.clock.1internal.build.speed=1
#avrdd.menu.clock.1internal.build.clocksource=0
#avrdd.menu.clock.24crystal=24 MHz crystal
#avrdd.menu.clock.24crystal.build.speed=24
#avrdd.menu.clock.24crystal.build.clocksource=1
#avrdd.menu.clock.20crystal=20 MHz crystal
#avrdd.menu.clock.20crystal.build.speed=20
#avrdd.menu.clock.20crystal.build.clocksource=1
#avrdd.menu.clock.16crystal=16 MHz crystal
#avrdd.menu.clock.16crystal.build.speed=16
#avrdd.menu.clock.16crystal.build.clocksource=1
#avrdd.menu.clock.12crystal=12 MHz crystal
#avrdd.menu.clock.12crystal.build.speed=12
#avrdd.menu.clock.12crystal.build.clocksource=1
#avrdd.menu.clock.8crystal=8 MHz crystal
#avrdd.menu.clock.8crystal.build.speed=8
#avrdd.menu.clock.8crystal.build.clocksource=1
#avrdd.menu.clock.24extclock=24 MHz ext. clock
#avrdd.menu.clock.24extclock.build.speed=24
#avrdd.menu.clock.24extclock.build.clocksource=2
#avrdd.menu.clock.20extclock=20 MHz ext. clock
#avrdd.menu.clock.20extclock.build.speed=20
#avrdd.menu.clock.20extclock.build.clocksource=2
#avrdd.menu.clock.16extclock=16 MHz ext. clock
#avrdd.menu.clock.16extclock.build.speed=16
#avrdd.menu.clock.16extclock.build.clocksource=2
#avrdd.menu.clock.12extclock=12 MHz ext. clock
#avrdd.menu.clock.12extclock.build.speed=12
#avrdd.menu.clock.12extclock.build.clocksource=2
#avrdd.menu.clock.8extclock=8 MHz ext. clock
#avrdd.menu.clock.8extclock.build.speed=8
#avrdd.menu.clock.8extclock.build.clocksource=2
#avrdd.menu.clock.28internal=28 MHz internal (overclocked)
#avrdd.menu.clock.28internal.build.speed=28
#avrdd.menu.clock.28internal.build.clocksource=0
#avrdd.menu.clock.32internal=32 MHz internal (overclocked)
#avrdd.menu.clock.32internal.build.speed=32
#avrdd.menu.clock.32internal.build.clocksource=0
#avrdd.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrdd.menu.clock.25crystal.build.speed=25
#avrdd.menu.clock.25crystal.build.clocksource=1
#avrdd.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrdd.menu.clock.28crystal.build.speed=28
#avrdd.menu.clock.28crystal.build.clocksource=1
#avrdd.menu.clock.30crystal=30 MHz crystal (overclocked)
#avrdd.menu.clock.30crystal.build.speed=30
#avrdd.menu.clock.30crystal.build.clocksource=1
#avrdd.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrdd.menu.clock.32crystal.build.speed=32
#avrdd.menu.clock.32crystal.build.clocksource=1
#avrdd.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrdd.menu.clock.36crystal.build.speed=36
#avrdd.menu.clock.36crystal.build.clocksource=1
#avrdd.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrdd.menu.clock.40crystal.build.speed=40
#avrdd.menu.clock.40crystal.build.clocksource=1
#avrdd.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrdd.menu.clock.25extclock.build.speed=25
#avrdd.menu.clock.25extclock.build.clocksource=2
#avrdd.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrdd.menu.clock.28extclock.build.speed=28
#avrdd.menu.clock.28extclock.build.clocksource=2
#avrdd.menu.clock.30extclock=30 MHz ext. clock (overclocked)
#avrdd.menu.clock.30extclock.build.speed=30
#avrdd.menu.clock.30extclock.build.clocksource=2
#avrdd.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrdd.menu.clock.32extclock.build.speed=32
#avrdd.menu.clock.32extclock.build.clocksource=2
#avrdd.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrdd.menu.clock.36extclock.build.speed=36
#avrdd.menu.clock.36extclock.build.clocksource=2
#avrdd.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrdd.menu.clock.40extclock.build.speed=40
#avrdd.menu.clock.40extclock.build.clocksource=2
#avrdd.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrdd.menu.clock.48extclock.build.speed=48
#avrdd.menu.clock.48extclock.build.clocksource=2

