SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
#avrddopti.bootloader.tool=avrdude
#avrddopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.timeout}.hex
#avrddopti.bootloader.WDTCFG=0x00
#avrddopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
#avrddopti.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
#avrddopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
##avrddopti.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
#avrddopti.bootloader.CODESIZE=0x00
#avrddopti.bootloader.BOOTSIZE=0x01
#avrddopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
#avrddopti.bootloader.pymcuprogstring=-f{bootloader.file} -a write

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrddopti.build.mcupostfix=opti
#avrddopti.build.printfabr=
#avrddopti.build.wireabr=
#avrddopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
#avrddopti.menu.chip.avr64dd14=AVR64DD14
#avrddopti.menu.chip.avr64dd14.build.mcu=avr64dd14
#avrddopti.menu.chip.avr64dd14.bootloader.class=optiboot_dd64
#avrddopti.menu.chip.avr64dd14.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd14.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd14.build.highestcb=B1
#avrddopti.menu.chip.avr64dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr64dd20=AVR64DD20
#avrddopti.menu.chip.avr64dd20.build.mcu=avr64dd20
#avrddopti.menu.chip.avr64dd20.bootloader.class=optiboot_dd64
#avrddopti.menu.chip.avr64dd20.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd20.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd20.build.highestcb=B1
#avrddopti.menu.chip.avr64dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr64dd28=AVR64DD28
#avrddopti.menu.chip.avr64dd28.build.mcu=avr64dd28
#avrddopti.menu.chip.avr64dd28.bootloader.class=optiboot_dd64
#avrddopti.menu.chip.avr64dd28.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd28.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr64dd32=AVR64DD32
#avrddopti.menu.chip.avr64dd32.build.mcu=avr64dd32
#avrddopti.menu.chip.avr64dd32.bootloader.class=optiboot_dd64
#avrddopti.menu.chip.avr64dd32.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd32.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd32.build.variant=32in-ddseries
#avrddopti.menu.chip.avr32dd14=AVR32DD14
#avrddopti.menu.chip.avr32dd14.build.mcu=avr32dd14
#avrddopti.menu.chip.avr32dd14.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd14.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd14.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd14.build.highestcb=B1
#avrddopti.menu.chip.avr32dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr32dd20=AVR32DD20
#avrddopti.menu.chip.avr32dd20.build.mcu=avr32dd20
#avrddopti.menu.chip.avr32dd20.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd20.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd20.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd20.build.highestcb=B1
#avrddopti.menu.chip.avr32dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr32dd28=AVR32DD28
#avrddopti.menu.chip.avr32dd28.build.mcu=avr32dd28
#avrddopti.menu.chip.avr32dd28.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd28.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd28.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr32dd32=AVR32DD32
#avrddopti.menu.chip.avr32dd32.build.mcu=avr32dd32
#avrddopti.menu.chip.avr32dd32.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd32.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd32.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd32.build.variant=32in-ddseries
#avrddopti.menu.chip.avr16dd14=AVR16DD14
#avrddopti.menu.chip.avr16dd14.build.mcu=avr16dd14
#avrddopti.menu.chip.avr16dd14.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd14.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd14.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd14.build.highestcb=B1
#avrddopti.menu.chip.avr16dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr16dd20=AVR16DD20
#avrddopti.menu.chip.avr16dd20.build.mcu=avr16dd20
#avrddopti.menu.chip.avr16dd20.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd20.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd20.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd20.build.highestcb=B1
#avrddopti.menu.chip.avr16dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr16dd28=AVR16DD28
#avrddopti.menu.chip.avr16dd28.build.mcu=avr16dd28
#avrddopti.menu.chip.avr16dd28.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd28.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd28.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr16dd32=AVR16DD32
#avrddopti.menu.chip.avr16dd32.build.mcu=avr16dd32
#avrddopti.menu.chip.avr16dd32.bootloader.class=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd32.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd32.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd32.build.variant=32in-ddseries

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
#avrddopti.menu.clock.24internal=24 MHz internal
#avrddopti.menu.clock.24internal.build.speed=24
#avrddopti.menu.clock.24internal.build.clocksource=0
#avrddopti.menu.clock.20internal=20 MHz internal
#avrddopti.menu.clock.20internal.build.speed=20
#avrddopti.menu.clock.20internal.build.clocksource=0
#avrddopti.menu.clock.16internal=16 MHz internal
#avrddopti.menu.clock.16internal.build.speed=16
#avrddopti.menu.clock.16internal.build.clocksource=0
#avrddopti.menu.clock.12internal=12 MHz internal
#avrddopti.menu.clock.12internal.build.speed=12
#avrddopti.menu.clock.12internal.build.clocksource=0
#avrddopti.menu.clock.10internal=10 MHz internal
#avrddopti.menu.clock.10internal.build.speed=10
#avrddopti.menu.clock.10internal.build.clocksource=0
#avrddopti.menu.clock.8internal=8 MHz internal
#avrddopti.menu.clock.8internal.build.speed=8
#avrddopti.menu.clock.8internal.build.clocksource=0
#avrddopti.menu.clock.4internal=4 MHz internal
#avrddopti.menu.clock.4internal.build.speed=4
#avrddopti.menu.clock.4internal.build.clocksource=0
#avrddopti.menu.clock.1internal=1 MHz internal
#avrddopti.menu.clock.1internal.build.speed=1
#avrddopti.menu.clock.1internal.build.clocksource=0
#avrddopti.menu.clock.24crystal=24 MHz crystal
#avrddopti.menu.clock.24crystal.build.speed=24
#avrddopti.menu.clock.24crystal.build.clocksource=1
#avrddopti.menu.clock.20crystal=20 MHz crystal
#avrddopti.menu.clock.20crystal.build.speed=20
#avrddopti.menu.clock.20crystal.build.clocksource=1
#avrddopti.menu.clock.16crystal=16 MHz crystal
#avrddopti.menu.clock.16crystal.build.speed=16
#avrddopti.menu.clock.16crystal.build.clocksource=1
#avrddopti.menu.clock.12crystal=12 MHz crystal
#avrddopti.menu.clock.12crystal.build.speed=12
#avrddopti.menu.clock.12crystal.build.clocksource=1
#avrddopti.menu.clock.8crystal=8 MHz crystal
#avrddopti.menu.clock.8crystal.build.speed=8
#avrddopti.menu.clock.8crystal.build.clocksource=1
#avrddopti.menu.clock.24extclock=24 MHz ext. clock
#avrddopti.menu.clock.24extclock.build.speed=24
#avrddopti.menu.clock.24extclock.build.clocksource=2
#avrddopti.menu.clock.20extclock=20 MHz ext. clock
#avrddopti.menu.clock.20extclock.build.speed=20
#avrddopti.menu.clock.20extclock.build.clocksource=2
#avrddopti.menu.clock.16extclock=16 MHz ext. clock
#avrddopti.menu.clock.16extclock.build.speed=16
#avrddopti.menu.clock.16extclock.build.clocksource=2
#avrddopti.menu.clock.12extclock=12 MHz ext. clock
#avrddopti.menu.clock.12extclock.build.speed=12
#avrddopti.menu.clock.12extclock.build.clocksource=2
#avrddopti.menu.clock.8extclock=8 MHz ext. clock
#avrddopti.menu.clock.8extclock.build.speed=8
#avrddopti.menu.clock.8extclock.build.clocksource=2
#avrddopti.menu.clock.28internal=28 MHz internal (overclocked)
#avrddopti.menu.clock.28internal.build.speed=28
#avrddopti.menu.clock.28internal.build.clocksource=0
#avrddopti.menu.clock.32internal=32 MHz internal (overclocked)
#avrddopti.menu.clock.32internal.build.speed=32
#avrddopti.menu.clock.32internal.build.clocksource=0
#avrddopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrddopti.menu.clock.25crystal.build.speed=25
#avrddopti.menu.clock.25crystal.build.clocksource=1
#avrddopti.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrddopti.menu.clock.28crystal.build.speed=28
#avrddopti.menu.clock.28crystal.build.clocksource=1
#avrddopti.menu.clock.30crystal=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30crystal.build.speed=30
#avrddopti.menu.clock.30crystal.build.clocksource=1
#avrddopti.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrddopti.menu.clock.32crystal.build.speed=32
#avrddopti.menu.clock.32crystal.build.clocksource=1
#avrddopti.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrddopti.menu.clock.36crystal.build.speed=36
#avrddopti.menu.clock.36crystal.build.clocksource=1
#avrddopti.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrddopti.menu.clock.40crystal.build.speed=40
#avrddopti.menu.clock.40crystal.build.clocksource=1
#avrddopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrddopti.menu.clock.25extclock.build.speed=25
#avrddopti.menu.clock.25extclock.build.clocksource=2
#avrddopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrddopti.menu.clock.28extclock.build.speed=28
#avrddopti.menu.clock.28extclock.build.clocksource=2
#avrddopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
#avrddopti.menu.clock.30extclock.build.speed=30
#avrddopti.menu.clock.30extclock.build.clocksource=2
#avrddopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrddopti.menu.clock.32extclock.build.speed=32
#avrddopti.menu.clock.32extclock.build.clocksource=2
#avrddopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrddopti.menu.clock.36extclock.build.speed=36
#avrddopti.menu.clock.36extclock.build.clocksource=2
#avrddopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrddopti.menu.clock.40extclock.build.speed=40
#avrddopti.menu.clock.40extclock.build.clocksource=2
#avrddopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrddopti.menu.clock.48extclock.build.speed=48
#avrddopti.menu.clock.48extclock.build.clocksource=2

